Revit 2027 API
RebarCrankOverridableParameters.GetCrankEndStraightLengthFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankEndStraightLengthFormulaParams()
Public Function GetCrankEndStraightLengthFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankEndStraightLengthFormulaParams()
member GetCrankEndStraightLengthFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 returns the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace